// * Разделять все задания комментариями и писать что нужно делать в задании.

// 1. Создайте функцию, которая выводит текст Hello, World! в консоль с задержкой в ​​3 секунды с помощью setTimeout.
//   Опишите в console.info как функция выполняется асинхронно.

// 2. Создайте промиссифицированные функции, и функцию выполняющую несколько запросов к различным промиссифицированным функциям с помощью
//    - Promise.all
//    - Promise.allSettled
//    - Promice.race
//    - Promice.any

// 3. Используя асинхронный код, напишите программу,
//    которая выполняет определенную асинхронную операцию (например задержка с помощью setTimeout) несколько раз в цикле.
//    Укажите, как код выполняется асинхронно и управляется с использованием:
//    - async/await
//    - Promise

// 4. Создайте анимацию объекта на веб-странице, используя только CSS для анимации (например, @keyframes).
//    Затем используйте JavaScript для асинхронного запуска анимации, например при клике на кнопку.