#Завдання 1
#Користувач вводить з клавіатури три числа. Залежно від вибору
#користувача, програма виводить на екран суму трьох чисел або
#добуток трьох чисел.


num1 = int(input("Введіть перше число: "))
num2 = int(input("Введіть друге число: "))
num3 = int(input("Введіть третє число: "))
act = input("Введіть бажану дію (* або +): ")

if act == '+':
    res1 = num1 + num2 + num3
    print(f"Сума: {res1}")
else:
    res2 = num1 * num2 * num3
    print(f"Добуток: {res2}")

#Завдання 2
#Користувач вводить з клавіатури три числа. Залежно від вибору
#користувача, програма виводить на екран максимум із трьох,
#мінімум із трьох або середньоарифметичне трьох чисел.

num4 = int(input("введіть перше число: "))
num5 = int(input("введіть друге число: "))
num6 = int(input("введіть трете число: "))
act2 = input('виберіть дію(максимум, мінімум, середнє): ')

if act2 == 'максимум':
     if num4 > num5 and num4 > num6:
         print("перше число більше")
     elif num5 > num4 and num5 > num6:
         print("друге число більше")
     elif num4 == num5 and num5 == num6:
         print('числа рівні')
     else:
         print('третє число більше')

elif act2 == 'мінімум':
     if num4 < num5 and num4 < num6:
         print("перше число менше")
     elif num5 < num4 and num5 < num6:
         print("друге число менше")
     elif num4 == num5 and num5 == num6:
         print('числа рівні')
     else:
         print('третє число менше')

elif act2 == "середнє":
     ave = (num4 + num5 + num6)/3
     print(f'середнє {ave}')
else:
     print('дія обрано не правильно')

#Завдання 3
#Користувач вводить з клавіатури якусь кількість метрів.
#Залежно від вибору користувача, програма конвертує метри в
#милі, дюйми або ярди.

metr = int(input('Введіть кількість метрів: '))
act3 =  input('ведіть в яку систему виміру конвертувати(милі, дюйми, ярди: ')

if act3 == "милі":
    cute = metr * 0.000621371
    print(f'в {metr} метрах {cute} милі')
elif act3 == 'дюйми':
    inch = metr * 39.3701
    print(f'в {metr} метрах {inch} дюймів')
elif act3 == 'ярди':
    yards = metr * 1.09361
    print(f'в {metr} метрах {yards} ярдів')
else:
    print('Error')